---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalBeamSlabWarning
source: html/9fa46dec-a039-0539-5447-766658b9133f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalBeamSlabWarning Property

Beam and Slab Analytical Models do not have the same Analytical Projection Plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalBeamSlabWarning { get; }
```